{
    "overview_company": [
        "Kapil Cotex Ltd is a listed public company incorporated on 17 October, 1983. It is classified as a public limited company and is located in Mumbai City, Maharashtra. It's authorized share capital is INR 2.00 cr and the total paid-up capital is INR 1.04 cr.",
        "Kapil Cotex Ltd's operating revenues range is Under INR 1 cr for the financial year ending on 31 March, 2014. It's EBITDA has increased by 9.15 % over the previous year. At the same time, it's book networth has increased by 1.47 %. Other performance and liquidity ratios are available here.",
        "",
        "The current status of Kapil Cotex Ltd is - Active.",
        "The last reported AGM (Annual General Meeting) of Kapil Cotex Ltd, per our records, was held on 30 September, 2022.",
        "Kapil Cotex Ltd has five directors - Yogesh Nandlal Chandak, Poonam Prakash Rathi, and others.",
        "The Corporate Identification Number (CIN) of Kapil Cotex Ltd is L17100MH1983PLC031114. The registered office of Kapil Cotex Ltd is at SHOP NO. 276, DREAMS MALL, L. B. S. MARG, NEAR BHANDUP RAILWAY STATION, BHANDUP (WEST),, MUMBAI, Mumbai City, Maharashtra.",
        "",
        "L17100MH1983PLC031114",
        "17 October, 1983 / 40 yrs",
        "30 September, 2022",
        "INR 200.0 Lacs",
        "INR 104.0 Lacs",
        "Manufacture of textiles",
        "Listed Public Company",
        "Company limited by Shares",
        "Non-govt company",
        "Login for email address. This is to prevent spam.",
        "Website not known. Click here to let us know.",
        "SHOP NO. 276, DREAMS MALL, L. B. S. MARG,\nNEAR BHANDUP RAILWAY STATION, BHANDUP (WEST),\nMUMBAI\nMumbai City - 400078\nMaharashtra - India",
        "A Company report by Tofler is an easy-to-read PDF report that includes company's financial information, ratio analysis, management, group structure, shareholding pattern and more. Such reports can be bought from company pages at Tofler (Sample) or can be downloaded from Company360. Here is the video showing how a report downloaded from Company360 looks like.",
        "Tofler Company360 provides access to any Indian company's financial documents, charts, ratio analysis and more. It lets you compare financials of several companies and study performance trends. These financials can also be downloaded in excel format. Here is the video showing how you can study the financials of an Indian company on the Company360 platform.",
        "",
        "",
        "The company has 5 directors and 2 reported key management personnel.",
        "The longest serving director currently on board is Prakashchandra Rathi who was appointed on 28 June, 2003. Prakashchandra Rathi has been on the board for more than 19 years. The most recently appointed director is Jagdish Manohar Mantri, who was appointed on 07 September, 2017.",
        "Prakashchandra Rathi has the largest number of other directorships with a seat at a total of 3 companies. In total, the company is connected to 2 other companies through its directors.",
        "",
        "PRAKASHCHANDRA RATHI",
        "Director",
        "YOGESH NANDLAL CHANDAK",
        "Director",
        "POONAM PRAKASH RATHI",
        "Director",
        "RAKESH RAMSWAROOP SOMANI",
        "Director",
        "JAGDISH MANOHAR MANTRI",
        "Director",
        "SWATI MAHESHWARI",
        "KMP",
        "PRAKASHCHANDRA RATHI",
        "KMP",
        "",
        "No Indian subsidiary companies found.",
        "Tofler Company network is a powerful feature that allows you to explore and discover common directorships between companies. It helps you find out other directorships of an Indian director and where else he has business interests. The feature is available for unlimited use in Company360 platform. Here is the video showing how you can explore company networks to discover hidden relationships between companies.",
        "",
        "",
        "",
        ""
    ]
}