[
    {
        "title": "Little Tannie",
        "avatar": "https://play-lh.googleusercontent.com/a-/ACB-R5QPQe9w2pWZ_ZiFyy_9xpQDAQzaO4BZeSBuWFMl",
        "rating": 3.0,
        "snippet": "Free fire's newest patch has a few bugs and issues. For example, when I played on PC after updating, the controls are totally messed up and the sprint, jump, fire, reload etc., are not working. I tried adjusting the controls in the BlueStacks app, and in the game itself, yet, the issue is not resolved. Please try to fix this issue in the next patch.",
        "likes": 1978,
        "date": "March 22, 2023"
    },
    {
        "title": "Govardhan P",
        "avatar": "https://play-lh.googleusercontent.com/a/AGNmyxZ3Ld4icjOWKhWNZGEbbcmj4_VP06TCi_2uvejm=mo",
        "rating": 3.0,
        "snippet": "Free Fire is a game with great potential, but unfortunately, it falls short due to the overwhelming number of glitches and bugs. From fake damages to noticeable delays, the game's performance leaves a lot to be desired. Players have also facing problems like enemies firing through gloo walls, which completely ruins the gameplay experience. To make matters worse, the gloo latency is getting progressively worse, making it harder to enjoy the game as it was intended.",
        "likes": 7366,
        "date": "March 10, 2023"
    },
    {
        "title": "Sonu Kumar",
        "avatar": "https://play-lh.googleusercontent.com/a-/ACB-R5STMz0VkJxaU_2vnvoTe8l1W05Her_A_jA6aRCHmg",
        "rating": 5.0,
        "snippet": "I liked the game very much, amazing.Nice clean graphics, controls, sensitivity and stability. Only there are few issues like when a player force quits at the beginning, it should be automatically replaced, and if the player quits in between it should be replaced at least by a low-skill ai player, because it damages the star ranking of others. Also the lod(object)collision dimension is more,while scoping even the target is in the scope, because of this the bullets don't hit enemy,instead wall is",
        "likes": 186904,
        "date": "March 22, 2023"
    },
    {
        "title": "Lord Yask.",
        "avatar": "https://play-lh.googleusercontent.com/a/AGNmyxYU5CTbRc1TFrDhwvyYa8L1VgVTzMZV1X0FM3jW=mo",
        "rating": 4.0,
        "snippet": "I liked the game very much,amazing.Nice clean graphics,controls,sensitivity and stability.Only there are few issues like when a player force quits at the beginning,it should be automatically replaced,and if the player quits in between it should be replaced at least by a low-skill ai player,because it damages the star ranking of others. Also the lod(object)collision dimension is more,while scoping even the target is in the scope,because of this the bullets don't hit enemy ,instead wall is hit.",
        "likes": 217591,
        "date": "March 19, 2023"
    },
    {
        "title": "Eric Mcleish",
        "avatar": "https://play-lh.googleusercontent.com/a-/ACB-R5RQy_dCwmTH1AAnK62dvS-wAUklNQdrZdmF-1rx1Q",
        "rating": 3.0,
        "snippet": "I dunno what happened with the latest updates, but it seriously needs fixing and it can start with something as simple as bug report specifications. Since yesterday, I couldn't play any game modes other than BR-Ranked which is annoying. Every time I try to change it, a loading icon pops up on my screen, rendering the game unresponsive. I really don't want to uninstall it to reinstall again, because even that is too tedious to deal with. Please make a full game version to make the process easier.",
        "likes": 7519,
        "date": "April 30, 2023"
    },
    {
        "title": "Isaac Max Wolf",
        "avatar": "https://play-lh.googleusercontent.com/a-/ACB-R5RVoIHAjaQEaZ62Dm7M-_FcAZeBn5dGyVe14EIl",
        "rating": 3.0,
        "snippet": "I have no problem with the bad graphics. The graphics are sufficient to support low-end devices and are characteristic, in my opinion. The problem is the bugs in the game, for example the Homer drone which often gets stuck when used on top of enemies (for example on the factory ladder and other places). If Garena can fix the bug, then you can improve the graphics.",
        "likes": 109250,
        "date": "March 23, 2023"
    },
    {
        "title": "Darshan Dhamapurkar",
        "avatar": "https://play-lh.googleusercontent.com/a-/ACB-R5Tz3WYjMkeC1K9oUYNaZdIXtv_ZN-XlB7lEQYmm",
        "rating": 4.0,
        "snippet": "Matchmaking time has improved. There is no option to enable MSAA or any AA and select specific FPS on quite capable devices. While two fingers pressed the pin gets set at a different location than desired after being knocked down when this feature needs to be used to alert your teammates quickly. Sometimes, the pin gets set at close distance while aiming far away. On some buildings, shadow appears as broken down into vertical bars of shadows as if there are many such pillars to be casting it.",
        "likes": 15475,
        "date": "March 22, 2023",
        "response": {
            "title": "Garena International I",
            "snippet": "Thank you for your suggestions. We will recommend them to the related department.",
            "date": "February 12, 2023"
        }
    },
    {
        "title": "Dly Pam",
        "avatar": "https://play-lh.googleusercontent.com/a-/ACB-R5T5ZdilS9L6Kg_XJprGz35ppWKvuLJZAOzlT676Qg",
        "rating": 1.0,
        "snippet": "After the latest update the game got so bad.to many bugs n glitch.These two things are the worst and often happens.1. When I want to play a character in the first set, it will automatically switch to the second set when starting the game.2.Bug in control while in game and control gets stuck.Control is the most important thing in this game.Hope it can be fixed as soon as possible.",
        "likes": 12981,
        "date": "March 26, 2023"
    },
    {
        "title": "Ashwin Thomas",
        "avatar": "https://play-lh.googleusercontent.com/a-/ACB-R5QdEBvY83q5f33ZeRLARdyP-rluCb8qmr7ZZnKu",
        "rating": 3.0,
        "snippet": "Very nice game and I love playing this. But this game has a lot of glitches and ping issues. even when I take cover I will get damge and knocked( even when I using a high speed WiFi ) One more. In rank games I can't remove any maps. I didn't want to play in next terra or purgatory or anyother. Now I have only two maps next terra and Bermuda but all the time when I play I only getting next terra map. I dont like this. I just eant to play in Bermuda",
        "likes": 15138,
        "date": "April 05, 2023"
    },
    {
        "title": "sumit kumar bishwas",
        "avatar": "https://play-lh.googleusercontent.com/a-/ACB-R5Q7K0e1BXp_kf3NBUaLqxv96LqB8mnpbUT5gn3T",
        "rating": 5.0,
        "snippet": "I love ff because it's really a fun game and also competitive. Garena also comes up with creative and new modes which are so fun. Why I rated it 5 stars is because of the graphics and glitches. The graphics when you are parachuting is horrible and I think the trees and house textures can be improved. Moreover when am playing the game, it stops working and comes out and I have to restart the game and reconnect to what was playing. most of the time I get killed. Everything else is pretty good",
        "likes": 36745,
        "date": "March 22, 2023"
    }
]